## TF Plan for app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 12 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.app will be created
  + resource "aws_acm_certificate" "app" {
      + arn                       = (known after apply)
      + domain_name               = "app.learning-resources.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.app.learning-resources.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "app.learning-resources.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.app.learning-resources.cdssandbox.xyz",
        ]
      + tags                      = {
          + "Environment" = "staging"
        }
      + tags_all                  = {
          + "Environment" = "staging"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.app will be created
  + resource "aws_acm_certificate_validation" "app" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_apigatewayv2_api_mapping.app will be created
  + resource "aws_apigatewayv2_api_mapping" "app" {
      + api_id      = "ktr0ux57bk"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # aws_apigatewayv2_deployment.app will be created
  + resource "aws_apigatewayv2_deployment" "app" {
      + api_id        = "ktr0ux57bk"
      + auto_deployed = (known after apply)
      + description   = "App deployment"
      + id            = (known after apply)
    }

  # aws_apigatewayv2_domain_name.app will be created
  + resource "aws_apigatewayv2_domain_name" "app" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "app.learning-resources.cdssandbox.xyz"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn    = (known after apply)
          + endpoint_type      = "REGIONAL"
          + hosted_zone_id     = (known after apply)
          + security_policy    = "TLS_1_2"
          + target_domain_name = (known after apply)
        }
    }

  # aws_apigatewayv2_integration.app will be created
  + resource "aws_apigatewayv2_integration" "app" {
      + api_id                                    = "ktr0ux57bk"
      + connection_type                           = "INTERNET"
      + description                               = "Learning app lambda integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.app will be created
  + resource "aws_apigatewayv2_route" "app" {
      + api_id             = "ktr0ux57bk"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.app will be created
  + resource "aws_apigatewayv2_stage" "app" {
      + api_id        = "ktr0ux57bk"
      + arn           = (known after apply)
      + auto_deploy   = false
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # aws_lambda_function.learning_resources will be created
  + resource "aws_lambda_function" "learning_resources" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "learning-frontend"
      + id                             = (known after apply)
      + image_uri                      = "236007890657.dkr.ecr.ca-central-1.amazonaws.com/learning-resources/learning-frontend:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::236007890657:role/learning-resources-app"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "contentful_cda_access_token" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "learning-frontend"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:ca-central-1:236007890657:ktr0ux57bk/*/*/"
      + statement_id  = "AllowLambdaInvoke"
    }

  # aws_route53_record.app["*.app.learning-resources.cdssandbox.xyz"] will be destroyed
  - resource "aws_route53_record" "app" {
      - allow_overwrite = true -> null
      - fqdn            = "_e87f2e83e7d7fdbab75cb36b408014f1.app.learning-resources.cdssandbox.xyz" -> null
      - id              = "Z05184832K8BFE95NJU34__e87f2e83e7d7fdbab75cb36b408014f1.app.learning-resources.cdssandbox.xyz._CNAME" -> null
      - name            = "_e87f2e83e7d7fdbab75cb36b408014f1.app.learning-resources.cdssandbox.xyz" -> null
      - records         = [
          - "_55363189c06bc66a2a2f1193901a24bf.vybhcgkthd.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z05184832K8BFE95NJU34" -> null
    }

  # aws_route53_record.app["app.learning-resources.cdssandbox.xyz"] will be destroyed
  - resource "aws_route53_record" "app" {
      - allow_overwrite = true -> null
      - fqdn            = "_e87f2e83e7d7fdbab75cb36b408014f1.app.learning-resources.cdssandbox.xyz" -> null
      - id              = "Z05184832K8BFE95NJU34__e87f2e83e7d7fdbab75cb36b408014f1.app.learning-resources.cdssandbox.xyz._CNAME" -> null
      - name            = "_e87f2e83e7d7fdbab75cb36b408014f1.app.learning-resources.cdssandbox.xyz" -> null
      - records         = [
          - "_55363189c06bc66a2a2f1193901a24bf.vybhcgkthd.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z05184832K8BFE95NJU34" -> null
    }

  # aws_route53_record.validation["*.app.learning-resources.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05184832K8BFE95NJU34"
    }

  # aws_route53_record.validation["app.learning-resources.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05184832K8BFE95NJU34"
    }

Plan: 12 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_api.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_domain_name.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_stage.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.learning_resources"]

23 tests, 16 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
